soap/wsdl/DeliveryServiceService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions targetNamespace="http://itechart.com/delivery" name="DeliveryServiceService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://itechart.com/delivery" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://itechart.com/delivery" schemaLocation="DeliveryServiceService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="place-order">
    <part name="parameters" element="tns:place-order"/>
  </message>
  <message name="place-orderResponse">
    <part name="parameters" element="tns:place-orderResponse"/>
  </message>
  <portType name="DeliveryService">
    <operation name="place-order">
      <input wsam:Action="http://itechart.com/delivery/DeliveryService/place-orderRequest" message="tns:place-order"/>
      <output wsam:Action="http://itechart.com/delivery/DeliveryService/place-orderResponse" message="tns:place-orderResponse"/>
    </operation>
  </portType>
  <binding name="DeliveryServicePortBinding" type="tns:DeliveryService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="place-order">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="DeliveryServiceService">
    <port name="DeliveryServicePort" binding="tns:DeliveryServicePortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

